Repository: mozilla-l10n/mt-training-data
Catalog: mgg/mgg_pontoon.tmx
Source language: en_us
Languages: mgg

source: Select File to Upload
mgg: Syɛɛka phɔtɔ milo mi ɛtwoŋgɛl ɓi kpɛl ɛkɛnd ê

source: Select up to three domains (optional)
mgg: Syɛɛka ipyat i milo mi mɛ̄kɛl milɛl

source: Sentence
mgg: Ɓwoŋa

source: Sentence Domain
mgg: Pyat mbɔŋ mɛ̄kɛl

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
mgg: mbɔŋ mɛ̄kɛl ɓi jüe mak ekɛ́, ɓáá gba myɛ ti pyat idóŋ ti kama cc-0

source: { $sentences } sentences reviewed. Thank you!
mgg: { $sentences } Mimbɔŋ mi mɛ̄kɛl ɗi kwombla ê. Mimyaŋla !

source: Sentence Variant
mgg: Mimbi mí mbɔŋ mi mɛ̄kɛl

source: Separate sentences into one line by pressing “Enter” or “Return” once
mgg: ɓɛska mimbɔŋ mí mɛ̄kɛl tí ɛnam kɛnd gwát tí «ɛni»

source: Service and Retail
mgg: Isɛɛ nɛ mɛphɔm mɛ igó

source: Share Common Voice
mgg: kaaká Jwónd gwát

source: Share your clip
mgg: Kaaká nwɔŋá ijwónd wen

source: Shortcuts
mgg: ɛthaŋ tí zizye

source: [Should be ‘dinosaurs’]
mgg: [i dala ɓɛ «otit » o mɛnan ɓɛ jóó náǎ iɗinozɔɔ ɓak]

source: [Should be “We are”]
mgg: yá á ku ɓɛ ɗyaŋ [I dala « ɛku ɓɛ ɗyaŋ »]

source: Single
mgg: Mbɔŋ mɛ̄kɛl ŋgwát nɛ ŋgwát

source: Single sentence submission
mgg: Ɛkɛnd mbɔŋ mɛ̄kɛl ŋgwát

source: Skip
mgg: ɛthaŋ

source: Small batch
mgg: Ɛɓim

source: Small batch sentence submission
mgg: Ɛkɛnd ɓiɓim mimbɔŋ mi mɛ̄kɛl

source: Source: { $sentenceSource }
mgg: ɛtin: { $sentenceSource }

source: Speak
mgg: ɛlüii

source: Speak now
mgg: ɓi nɛ khul ɛlüii

source: Speak options menu
mgg: Ɛɔp sa dala nɛ ɛthaŋ ê « Ɛlüii »

source: Start recording
mgg: nyɛlka ɛnwɔŋ ijwónd

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
mgg: <strong>[Ɛkaka]<strong> minjes mi otit o mɛ̄nan <strong> [ ɛkaka ]<strong> Tiias

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
mgg: [ ɛnupɛl ] minjés mi otit o mɛ̄nan [ kɔ́s ] Tiias

source: Submit
mgg: ɛkɛnd

source: Submit a new question for the community to read and respond to
mgg: Ɓaka jika wul miá tí ɛsu ɛ náǎ, ɓot o pyat ɓɛ laŋ ê, ɓɛ yalan thɔk

source: Submit a report
mgg: ɛkɛnd sá ɓa thaŋ ê

source: Submit clips
mgg: ɛkɛnd íjwónd i nwɔŋaa ɓîk

source: Submit new questions for the community to read and respond to
mgg: Ɓaka jüeká mimyenj mimiá tí ɛsu ɛ náǎ, phúphōŋ ɓɛ láŋ ê, ɓɛ ɓɛs thɔk mimiá mitek

source: Success
mgg: sá sɛɛ ekɛ́ i thaŋ ɛdala

source: success checkmark
mgg: ɛkus phɔtɔ ɛga

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
mgg: Puská yɛ ɓɛ̌ ɛdom tí ɛkam mbɔŋ mɛ̄kɛl. Puská ɓɛ ɛmyɛl tí ɛsu lɛ ɛɓyen. Puská ɓɛ̌ ɛkō tí ɛsu lɛ ɛɗim <strong> Ɓya a jesa ɛkend yil yɛ̂ɛs ɓi kwombɛm !</strong>

source: Taking several attempts to read a word.
mgg: ɛpapla ɛlaŋ ɛkɛl ikɛnd ikɛnd

source: Tap
mgg: Ɛnam sinɔŋ

source: Technology and Robotics
mgg: Isá i mítháŋa kus ê nɛ ivekle

source: Thank you for contributing your bulk submission!
mgg: Mimyaŋla nɛ dɔ náǎ, ɓí í thes thund mimbɔŋ mi mɛ̄kɛl!

source: Thank you for contributing your voice!
mgg: Mimyaŋla nɛ jwónd yēn ɓi jüe ê!

source: Thank you for donating your voice clips!
mgg: Mimyaŋla nɛ dɔ náǎ, ɓí í kam ɛjüe ɓes minwɔŋa mɛ ijwónd ɓyen !

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
mgg: Mimyaŋla tí mɛnwɔŋa mɛ ijwónd ɓyēn ! lineBreak></lineBreak>lineBreak></lineBreak> Ɛhyaak ɓi nɛ khul ɛkam, ɓi kɛnd isɛɛ ɓi sá ɗi ɓɛ si ɗêk ê.

source: Thank you for your voice information
mgg: Mimyaŋla ti nwɔŋa ijwónd ɗum nɛ sá ɓot dala nɛ ɛgu ê

source: The bumblebee sped by.
mgg: mama í í kamb

source: The clip has disrespectful or offensive language.
mgg: mɛkɛl ɓɛ nwɔŋ íjwond ɓîk ɓi isá i ɗí ta dala ɓîk gu mɛləə

source: The giant dinosaur of the Triassic.
mgg: njes tit mɛnan tiias ɓɛ jóó ɗinozɔɔ ɔ̂

source: The giant dinosaurs of the Triassi-.
mgg: minjes mi iɗinozɔɔ ɗí ɓɛ̌ tiia ɓak

source: The giant dinosaurs of the Triassic.
mgg: minjes mi otit o mɛ́nan o tiias ɓɛ jóó ɗinozɔɔ ɓak

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
mgg: Minjes mi ótit o mɛnan o tiias ɓɛ jóó náǎ, ɗinozɔɔ ê. [ laŋa nɛ jwónd ɛsɔk ]

source: The giant dinosaurs of the Triassic. Yes.
mgg: Ɛŋ, minjes mi iɗinozɔɔ ɗi ɓɛ Tiias ɓāk

source: The giant dino <strong>[cough]</strong> the Triassic.
mgg: njes tit mɛnan [ kɔ́s ] nɔl Tiias

source: There are currently no sentences to review in this language.
mgg: yaa ɓalǐ ɓɛ nɛ mbɔŋ mɛ̄kɛl tí ɛsu lɛ ɛtwoŋgɛl tí lüii enɛŋ

source: The recording was too long.
mgg: nwɔŋa jwónd i tí ɓuu daa

source: The recording was too quiet.
mgg: Nwɔŋa ijwónd i ɓɛ sī

source: The recording was too short.
mgg: nwɔŋa jwónd i tí ɓuu gulɔɔ

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
mgg: Ɓot o laŋ ɓak ɓaa ɓɛ nɛ ijwónd iphwát. Ɓi nɛ khul ɛmyas nwɔŋa ijwónd tɛ́m ɗi náǎ, jwónd tek i tí ɓuu ɓena, i tí ɛthes, (gu thɔk) tɛ́m ɗi ɓɛ si náǎ, mot aa ɓɛ nɛ khul ɛgwok gu yaa ɓɛ tila ê.

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
mgg: Mot sɔnj mimbɔŋ mi mɛ̄kɛl ɔkɛ́, ɛ́ ɛ́ tɔ ɓɛ pyat mílɔŋ Jwónd gwát. Ɓi nɛ khul ɛka<writeURL>til</writeURL> mbɔŋ mɛ̄kɛl<writeURL>Ɛguujüak</writeURL> mimbɔŋ mɛ̄kɛl gu mimbɔŋ mímɛ̄kɛl tí pyat Jwónd gwát.

source: The sentence has a grammatical or spelling error.
mgg: mbɔŋ mɛ̄kɛ̄l ú nɛ vus, gu tila ɗí ta dala ê

source: The sentence has disrespectful or offensive language.
mgg: mbɔŋ mɛ̄kɛ̄l ɗi nɛ isá ɓi ɛlwɔkɔɔ ɓîk gu thɔk mɛləə ê

source: The sentence must be grammatically correct.
mgg: Mbɔŋ mɛ̄kɛl u dala nɛ ɛɓɛ syesa

source: The sentence must be speakable.
mgg: Mbɔŋ mɛ̄kɛl ú dala ɓɛ nɛ khul ɛlaŋaa ɛnwɔɔnwɔŋ.

source: The sentence must be spelled correctly.
mgg: Mbɔŋ mɛ̄kɛl u dala nɛ ɛɓɛ tila ɛnwɔɔnwɔŋ.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
mgg: milɔŋ minɛɛŋ ɓi nɛ khul ɛkam gu ɛɓyen myɛ. Ɓi ɓɛɛ na ɓi nɛ nɔm nak ɛ́, ɓi nɛ khul ɛɓaka kɛl ɓyɛ. Tɛ́m zi kɛnd yɛ́ tí pyat mílɔŋ ekɛ, zaa nwɔŋ ɛkɔɔ nɛ mimbú gu tɛla wēn

source: Three to go!
mgg: Ithaŋ ikɛnd ilɛl !

source: Too many files
mgg: Thund iphɔtɔ milo mi ɛtwoŋgɛl

source: Transcribe audio recordings into text
mgg: Tilka minwɔŋa mɛ ijwónd tí mɛkaná

source: Transcribe audio recordings in your language
mgg: Ɛtil nwɔŋa ijwónd tí lüii yēn

source: Try again by dragging your file here
mgg: Ɓaka jwoklaká ɛkɛnd phɔtɔ milo mi ɛtwoŋgɛl wak

source: Try uploading again
mgg: Ɓaka jwoklaká ɛkɛnd

source: Understand contribution criteria
mgg: ɛgwok ɗɛ ɓɛ dala nɛ ɛsá ê

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
mgg: ɛguuhwok sá ɓɛ dala nɛ ɛsá tɛ́m ɓɛ wa nwɔŋ ijwónd, ɓi sá thɔk náǎ ijwónd i tēk ɓi dos ɛnwɔɔnwɔŋ

source: Upload aborted. Do you want to delete your recordings?
mgg: Yaa tɔ. Ɓi tí ɛkpɛl ɛɗim mɛnwɔŋa mɛ ijwónd ɓyen ɛ ?

source: { $uploadedSentences } of { $totalSentences } sentences collected
mgg: sɔnja míbɔŋ mi mɛ̄kɛl tí

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
mgg: sɔnja míbɔŋ mi mɛ̄kɛl tí .Namká <downloadLink> Wak </downloadLink> tí ɛsú lɛ́ ɛnwɔŋ mímbɔŋ mí mɛ̄kɛl ɓɛ myas mîk

source: Upload failed, please retry.
mgg: Yaa tɔ́, ɓaka jwoklaká

source: Upload <icon></icon> public domain sentences
mgg: Kɛndká <icon></icon> mimbɔŋ mi mɛ̄kɛl ɗum nɛ pyat milo mí mɛ̄kɛl jüak mot nyɛ̂ɛs ê

source: Upload in progress...
mgg: I tí ɛtɔ

source: Upload more sentences?
mgg: Ɛɓaka kɛndká míl mimbɔŋ mí mɛ̄kɛl ?

source: Use correct grammar
mgg: ɓi dala nɛ ɛtil ɗakɛ i je ê

source: Use correct spelling and punctuation
mgg: ikaŋga nɛ mɛtɔn ɓi dala nɛ ɛɗi ɛdala

source: Validate Readings
mgg: ɛkpɛnjɛl mílaŋá

source: Validate Readings, Review Transcriptions
mgg: ɛkam ɗɛ ɓɛ laŋ ê, ɓi jüak ɗɛ ɓɛ til ê

source: Validate Readings <small>(Coming soon)</small>
mgg: Ɛkam mílaŋa <small> ( tí mɛlu mɛ ɗí tí ɛzye mak) </small>

source: Validate readings submitted by community members
mgg: ɛkpɛnjɛl miláŋa mi ɓɛl ɓot o ndɔŋ

source: Validate user-recorded readings in your language
mgg: Ɛkam milaŋa ɓɛ nwɔŋ ijwónd nɛ ɓot o ɗi tí ɛɓɛla nɛ yɛ̄ tí lüii yēn ê

source: Varying Pronunciations
mgg: ɛtuɛl isínɔŋ ta ɓɛ mbi ŋgwát

source: Volume
mgg: ɛɓə́ŋn

source: Want to save your information? <createProfile>Create a profile</createProfile>
mgg: Ɓi tí ɛkpɛl ɛnwɔŋ ijwónd i sá ɓot dala nɛ ɛgu ekɛ? <createProfile>Kuská pyat milɔŋ nɛ aphɔmb nɛ phɔmb zen</createProfile>

source: We are going out to get a coffee.
mgg: tí ɛgu ɓɛɛ jües yá á kas ɛmyan

source: We are going out to get coffee.
mgg: tí ɛgu ɓɛɛ ɛ́, ɛmyan jües yá á kas

source: We couldn’t get any audio clips for you to listen to. Please try again later.
mgg: Za a ɓyela míl mindɛm mí mɛnwɔŋa mɛ ijwónd tí ɛgwókɛl. Ɓaká jwoklaká ɛphus

source: We couldn’t get any sentences for you to speak. Please try again later.
mgg: zaa ɓyelá mɛl mɛ̄kɛ̄l tí ɛsu lɛ ɛnwɔŋ íjwond. Ɓaka jwoklaká.

source: We may have run out of clips - refresh the page, or try again later.
mgg: zaaká tel nɛ mindɛm mi nwɔŋá ijwónd tí ɛkpɛnjɛl ti luii inɛɛŋ...

source: We’re going out to get coffee.
mgg: ti ɓɛɛ ɛ, jües yá á kas ɛ́myan

source: We're making some big changes
mgg: Zí í cenj thund isínɔŋ ɓɛ náǎ, i cenjaa ke

source: We’re sorry, your platform is not currently supported.
mgg: zi tí ɛji ɓen ijuka, sa gwát pyat isɛɛ yēn yaa ɓa lǐ dala

source: We've run out of sentences to record in this language...
mgg: ɓyaaká ɓɛ nɛ mbɔŋ mɛkɛl tí ɛnwɔŋ ijwond

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
mgg: I nɛ nɔm náǎ, isá i ɗi nɛ khul ɛkwombɛl isínɔŋ ɓi ɛyek ɓîk ɓi ɗi nɛ khul ɛgwok kukuu ɗi ɓɛ twóó ê. Isu mikukuu mi ɗi ɓɛ ɛkó ɓɛ nɛ khul ɛjisɔɔ myɛ, tɛ́m ɗi náǎ, yaa kambɛl ɓen ɓi gwok sá ɓa tilaa ê. Ɓi nɛ khul ɛgwok ida i luii si si ɓik, ta ɓɛ ɓíl í luii ɓɛ ɛko ɗi nɛ khul ɛkambɛl ɓēn náǎ ɓi guu gwok ɛnwɔɔnwɔŋ ê.

source: What issues are you experiencing with this sentence?
mgg: wɔɔ mbi sá ɓɛ tí kwɔɔla ɓoma nɛ yɛ tí mbɔŋ mɛ̄kɛ̄l o ke

source: What needs to be in my file?
mgg: Yɛ ɓɛ dala nɛ ɛɓyela twóó phɔtɔ milo mi ɛtwoŋgɛl myám e?

source: What sentences can I add?
mgg: Myɔɔ mimbɔŋ mi mɛ̄kɛl mi dala nɛ ɛkɛl mîk ?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
mgg: tɛ́m ɓi wa gwokɛl ekɛ́, gu jüaká náǎ ijwónd i nwɔŋaa ɓîk ɓi ɛdala nɛ sá ɗi tila ê. Ɓya a kam náǎ i ɗi nɛ jüas gwát nɛ gwát i su náǎ jüas tēk í ɓiɓyɔk./ ɓɛɛká ijüas i ɓuu nyen ɓîk

source: Why are you asking?
mgg: I yɛ ɓi ji mbi miá onɔɔŋ e?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
mgg: Nɛ pyat milɔŋ yēn ɛ́, ɓi nɛ khul ɛɗu lo sɛɛ wēn, ɓi ɗi lɛt nɛ ɓɛl ɓot o ɗi tí nwɔŋ ijwónd ɓak

source: Write
mgg: Ɛtil

source: Write options menu
mgg: Misoŋol tí pyat « Ɛtil »

source: y
mgg: ɛ

source: Y
mgg: Ɛ

source: Yes
mgg: ɛŋ

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
mgg: Ɓí nɛ khul ɛɓɛla nɛ izizye i teble ɓɛ til nɛ yɛ: { sc-review-form-button-approve-shortcut }, tí ɛsu lɛ ɛkam, { sc-review-form-button-reject-shortcut } ɛɓyen, { sc-review-form-button-skip-shortcut } gu thɔk tí ɛsu lɛ ɛkpɛnjɛl

source: You cannot add multiple sentences for a single submission
mgg: Ɓyaa ɓɛ nɛ khul ɛkɛl thund mimbɔŋ mi mɛ̄kɛl tɛ́m ɓi kpɛl ɛkɛnd mbɔŋ mɛ̄kɛl ŋgwát nɛ ŋgwát ê

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
mgg: Ɓya a syɛɛ lüii. Nikáná ɓɛ̌ <poofil link> ɗi poto yēn ê<profileLink> tí ɛsu lɛ ɛsaŋ ilüii

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
mgg: Í í kûm ɓím ɓí dala nɛ ɛkɛnd tí ɛfep lǐk ê. Ɓa bwôndká { $retryLimit } inútɛn ɛsɔ́k náǎ, ɓi ɓaka ɓaka kɛnd wṵl mbɔŋ mɛ́kɛl. Zi nɛ mimyaŋla nɛ nēn ɗɛ ɓí jisɔ̄ɔ̄ ɓes ê !

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
mgg: Í í kûm ɓím ɓí dala nɛ ɛkɛnd tí ɛfep lǐk ê. Ɓa ɓwôndká { $retryLimit } mimbyaala ɛsɔ́k náǎ, ɓi ɓaka ɓaka kɛnd wúl mbɔŋ mɛ́kɛl. Zi nɛ mimyaŋla nɛ dɔ,

source: You must allow microphone access.
mgg: Ɓi dala nɛ ɛsá náǎ, sá nwɔŋ ijwónd ikɛ, i tumb ê

source: You’re contributing to a target segment
mgg: Ɓi tí ɛkɛm isɛɛ tí lüii yēn tí mbɔŋ ɛdom

source: You’re contributing to our first target segment
mgg: Nyɛlká ɛsalaká tí lüii yēn

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
mgg: Ɓi tɔ lamb nɛ kamb. Nwɔŋká títɛ̌m tí ɛɓaka laŋ gu i tila ɛdala

source: You're helping Common Voice reach our daily sentence goals!
mgg: Ɓi tí ɛkɛm Jwónd Gwát náǎ, i lwondɛl mijea mi mimwes myɛ̂ɛs tí sá ɗum nɛ mimbɔŋ mi mɛ̄kɛl ê

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
mgg: mitila mi lüii yēn mi oke mó ó si. Ɓi ɓɛɛ náǎ i tí dala nak, ɓi nɛ khul ɛni twóó pyat milɔŋ tí ɛsu lɛ ɛɓaka gbɛs mil mímbɔŋ mi mɛkɛl tí lüii yēn

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
mgg: "mɛkɛl mén mɛ́ ɛ́ si. Ɓí ɓɛ nɛ tɛ́m nak, ɓí nɛ khull ɛɓaka twoŋgɛl tí ɛɓɛy ɗɛ ɗi náǎ ɓi nɛ khul ɛɓaka ɓye wul mbɔŋ mɛkɛl ê"

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mgg: Ɓyɔɔ sá náǎ, Jwónd gwát i lwóndɛl <goalPercentage></goalPercentage> njea wɛ́ mwes wɛ̂ɛs { $goalValue } ɛnwɔŋ íjwónd !

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mgg: Ɓyɔɔ sá náǎ, Jwónd gwát i lwondɛl <goalPercentage></goalPercentage> njea wɛ́ mwes wɛ̂ɛs { $goalValue } tí ɛkam !
